## Pandas Introduction

Importing Pandas

In [1]:
import pandas as pd

Checking version of python pandas

In [3]:
pd.__version__

'1.1.5'

Pandas can read 3 types of data structure :


*   Series
*   Data Frame
*   Panel

## Series Data Structure in Pandas


*   Series is a 1-D indexed array

In [ ]:
list_s = ['abc',1,2,3,'def']
print(list_s)

Creating Series using list

In [7]:
ser_1 = pd.Series(list_s)
print(ser_1)
type(ser_1)

0    abc
1      1
2      2
3      3
4    def
dtype: object

pandas.core.series.Series

In [10]:
ser_2 = pd.Series(['abc',1,2,3,'def'], index=[1,2,3,4,5]) # 1. you can assign index according to your need
                                                          # 2. number of index value should be same as number of items in Series
print(ser_2)

1    abc
2      1
3      2
4      3
5    def
dtype: object

In [12]:
ser_3 = pd.Series([67,1,2,3,6], index=[1,2,3,4,5], dtype='float') # you can pass/change datatype also.
print(ser_3)

1    67.0
2     1.0
3     2.0
4     3.0
5     6.0
dtype: float64

In [13]:
ser_4 = pd.Series([67,1,2,3,6], index=[1,2,3,4,5], dtype='float', name='data values') #column name 
print(ser_4)

1    67.0
2     1.0
3     2.0
4     3.0
5     6.0
Name: data values, dtype: float64

creating series with scalar values

In [15]:
ser_5 = pd.Series(0.5)
print(ser_5)

0    0.5
dtype: float64

creating Series with Dictionary

In [16]:
ser_6 = pd.Series({1:'a', 2:'b'})
print(ser_6)

1    a
2    b
dtype: object

In [21]:
ser_7 = pd.Series([67,1,2,3,6], index=[1,2,3,4,5], dtype='float', name='data values')

In [22]:
print(ser_7[1]) # can access any values with index value
print(ser_7[1:4]) # slicing

67.0
2    1.0
3    2.0
4    3.0
Name: data values, dtype: float64

In [23]:
print(max(ser_7), min(ser_7)) # max and min function

67.0 1.0

In [24]:
ser_7[ser_7 > 3] #conditional opreater

1    67.0
5     6.0
Name: data values, dtype: float64

Mathematical opreations

In [27]:
ser_8 = pd.Series([1,2,3,4])
ser_9 = pd.Series([6,7,8,9])
ser_10 = pd.Series([5,6])

In [26]:
ser_8 + ser_9  #both series have equal elements

0     7
1     9
2    11
3    13
dtype: int64

In [28]:
ser_8 + ser_10 #unequal number of elements are present in both the Series
                # NaN : Not a number

0    6.0
1    8.0
2    NaN
3    NaN
dtype: float64

In [30]:
ser_9 - ser_8

0    5
1    5
2    5
3    5
dtype: int64

#DataFrame



*    DataFrame is 2-D, size mutable, potentially heterogenous tabular data structure

How to create dataframe

In [31]:
emp = pd.DataFrame() #empty dataframe
print(emp)

Empty DataFrame
Columns: []
Index: []

creating dataframe using list

In [32]:
lst = [1,2,3,4]
df = pd.DataFrame(lst)

In [35]:
ls_of_ls = [[1,2,3],[4,5,6],[7,8,9]]
df2  = pd.DataFrame(ls_of_ls)
df2

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

creating dataframe with dictionary

In [36]:
dict1 = {'ID':[1,2,3], 'age':[30,89,67]} #values of all the keys should be equal
df3 = pd.DataFrame(dict1)
df3

   ID  age
0   1   30
1   2   89
2   3   67

creating dataframe with list of dictionary

In [37]:
ls_dict = [{'a':1, 'b':2},{'a':4,'b':5}]
df4 = pd.DataFrame(ls_dict)
df4

   a  b
0  1  2
1  4  5

In [38]:
ls_dict = [{'a':1, 'b':2},{'a':4,'b':5,'c':6}] #handling missing value
df4 = pd.DataFrame(ls_dict)
df4

   a  b    c
0  1  2  NaN
1  4  5  6.0

creating dataframe with dictionary of series

In [40]:
ser_dict  = {'ID':pd.Series([1,2,3])}
df5 = pd.DataFrame(ser_dict)
df5

   ID
0   1
1   2
2   3